Tekla Open API Reference for Tekla Structures 2025
DateTimeOperatorType Enumeration
 The DateTime operator type defines the operators between two DateTime filter expressions.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DateTimeOperatorType
Public Enumeration DateTimeOperatorType
Members
Member name | Value | Description
IS_EQUAL | 1 |  The "is equal" operator.
IS_NOT_EQUAL | 2 |  The "is not equal" operator.
EARLIER_THAN | 15 |  The "earlier than" operator.
EARLIER_OR_EQUAL | 16 |  The "earlier or equal" operator.
LATER_THAN | 17 |  The "later than" operator.
LATER_OR_EQUEL | 18 |  The "later or equal" operator.
See Also
Reference
Tekla.Structures.Filtering Namespace